:PROPERTIES:
:ID:       22E2131D-5ADF-46AD-BEBB-8A5745CBA94F
:END:
#+title: meta

A notebook for this project itself.

This project is called a "cabinet" which is a reference to a physical
zettelkasten setup which is likely to involve a card cabinet, and this
project uses org-roam to provide that model

* Setup

This provides documentation for two modes of setup, self-contained and embedded.

** Self-Contained

A self contained setup is one where the directoy acts as an independent cabinet.
This makes use of ~.dir-locals~.

This has the advantage of not accidentally getting tangled with any other org-roam
configurations, but has the disadvantage that it can't become part of a larger subgraph.

*** ~.dir-locals.el~

To prepare for working with this repository, the ~.dir-locals.el~
file must be tangled to configure the [[info:emacs#Directory Variables][directory variables]] that can be used
for a local [[id:BD998169-D426-4D3C-A775-D2D9ED6DCFA3][org-roam]] cabinet.

~.dir-locals.el~ makes use of static values, so this leverages some noweb expansion
to populate the appropriate directory at the time of tangling.

#+name: pwd
#+begin_src emacs-lisp
  default-directory
#+end_src

#+RESULTS: pwd
: /Users/mwhipple/memex/notebooks/

#+begin_src emacs-lisp :noweb yes :tangle .dir-locals.el
  ((nil . ((org-roam-directory  . "<<pwd()>>")
           (org-roam-db-location . "<<pwd()>>org-roam.db"))))
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
  org-roam-directory
#+end_src

#+RESULTS:
: /Users/mwhipple/memex

#+begin_src emacs-lisp
  org-roam-db-location
#+end_src

#+RESULTS:
: /Users/mwhipple/memex/notebooks/org-roam.db

** Embedded

An embdded setup is one in which this is loaded a subdirectory of an
existing cabinet.

The model used in this case is that this should be treated as somewhat
of a public tenant within a wider graph, and that the enclosing
cabinet should be able to reference the data within this subgraph, but
edges going in the other direction should be avoided/prevented.
